# Теория о кортежах в Python

Кортеж (tuple) — это неизменяемая структура данных в Python, которая представляет собой упорядоченную последовательность элементов. Кортежи используются, когда требуется хранить данные, которые не должны изменяться после создания.

### Основные свойства:
1. **Неизменяемость**: После создания кортеж нельзя изменить, удалить или добавить элементы.

2. **Упорядоченность**: Элементы в кортеже сохраняют свой порядок, в котором они были добавлены.

3. **Может содержать любые типы данных**: Кортежи могут хранить элементы разных типов, включая другие кортежи.


4. **Индексация**: Элементы кортежа доступны по индексам, начиная с 0.


5. **Хэшируемость**: Кортежи могут быть использованы как ключи в словарях, если их элементы тоже хэшируемы. Сейчас можно забить, понадобится в будущем. 

### Основные операции:
```python
tuple_1 = (1, 2, 3) # Создание
tuple_1[0] # Доступ по индексу
tuple_1[1:] # Срезы
len(tuple_1) # Длина
(1, 2) + (3, 4) # Конкатенация
2 in tuple_1 Проверка на наличие элемента 
```


### Особенности:
- Если создаётся кортеж из одного элемента, нужно добавить запятую: single = (5,)
- Кортежи более эффективны по памяти и времени выполнения по сравнению со списками.

### Применение:
- Хранение неизменяемых данных.
- Использование в качестве ключей в словарях.
- Передача нескольких значений из функции.

---

## Практические задачи

### 1. Гонка черепах
Первым видом спорта в соревнованиях была гонка черепах, а вас назначили судьёй. Проблема в том, что черепахи очень не любят общаться с другими черепахами. Поэтому каждая черепаха бежит гонку на то расстояние, на которое захочет. 

Хорошо, что вы успели записать сколько каждая черепаха пробежала, и сколько времени у неё это заняло. Поэтому мы можем понять, какая черепаха была самая быстрая.

Даны 2 кортежа:
1. C расстояниями, которые прошли черепахи. 
2. Со временем, которое у них это заняло

Нужно определить победителя гонки и вывести его номер.

**Формат ввода:**
В первой строке список чисел: расстояния, которые прошли черепахи по порядку номеров. 
В второй строке список чисел: сколько секунд длился забег каждой черепахи по порядку номеров.

 **Формат вывода:**
 Номер черепахи, которая выйграла. Нумерация начинается с 1. 

**Пример:**
```
# Ввод:
1 2 3 4 5
1 3 2 5 10

# Вывод:
3
```

### 2. Историческая викторина
Вторая игра: историческая викторина. Команды должы отвечать на вопросы о том, когда произошло то или иное событые. Проблема в том, что вопросы сделать забыли...

Хорошо, что у вас есть список всех, или почти всех важных событий. Он хранится в файле events.py. Вам нужно сделать программу викторину. 

**Все вопросы будут иметь вид**:
"Когда произошло <Название события>?"

Программа случайным образом выбирает событие и предлагает пользователю угадать год. 
- Если он ответил верно, то пишется "Верно" и викторина продолжается, задаётся следующий вопрос. 
- Если нет, то пишется "Неверно" и выводится число очков набранных пользователем.

#### Примечание
Для случайного выбора элемента списка может быть использована команда `random.choice`
Которая используется следующим образом:
```python
from random import choice

a = [1, 2, 3]

for i in range(10):
	print(choice(a))
```

### 3. Склад товаров
Олимпиада ещё идет, но вот беда: заболел главный счетовод. Теперь никто не может посчитать какая команда лидирует, а какая проигрывает. 

Хорошо, что у вас есть записи, у какой команды сколько медалей. Вам нужно выяснить, кто выигрывает по очкам, если
- Золотая медаль: 5 очков
- Серебрянная: 3 очка
- Бронзовая: 1 очко. 

**Формат ввода:**
В первой строке вводится N число команд.
После чего идут N строк, на каждой из которых по 3 числа: число золотых, серебрянных и бронзовых медалей. 
**Формат вывода:**
Номер команды победителя.

### 4. Битва магов
Соревнование три: Битва магов. А вы опять назначенны судьёй. 

Два мага собираются сразиться в магической дуэли. Каждый из них произносит три закилнания. Каждое заклинание имеет свою мощность, которая указана в отдельном списке. Если заклинания нет в списке, то его мощьность равна его длинне. Для каждого мага требуется подсчитать общую мощность его заклинаний и определить победителя. Если силы магов равны, объявляется ничья.

**Формат ввода**
1. Список заклинаний первого мага, каждое с новой строки
Пример: ["Огненный шар", "Ледяной шип", "Молния"]
2. Список заклинаний второго мага, каждое с новой строки:
Пример: ["Огненный взрыв", "Заклинание страха", "Чёрная метка"]

**Формат вывода**
1. Общая мощность заклинаний первого мага.
2. Общая мощность заклинаний второго мага
3. Результат: победил маг 1, маг 2 или ничья.

**Пример**

```python
# Ввод:
# первый маг
Огненный шар
Ледяной шип
Молния
# Второй маг
Огненный взрыв
Заклинание страха
Чёрная метка

# Вывод:
Общая мощность мага 1: 150
Общая мощность мага 2: 195
Победил маг 2!
```


---

#### Список заклинаний на Python
```python
spells = [
    ("Огненный шар", 50),
    ("Ледяной шип", 40),
    ("Молния", 60),
    ("Магический барьер", 30),
    ("Призыв дракона", 100),
    ("Исцеляющий свет", 35),
    ("Кислотный дождь", 55),
    ("Шипастая ловушка", 45),
    ("Вихрь клинков", 70),
    ("Заклинание страха", 25),
    ("Огненный взрыв", 80),
    ("Ледяная стена", 50),
    ("Чёрная метка", 90),
    ("Призыв элементаля", 75),
    ("Солнечный луч", 65),
    ("Водяной поток", 40),
    ("Громовой удар", 85),
    ("Воскрешение", 95),
    ("Мгновенный телепорт", 20),
    ("Песчаная буря", 45),
    ("Тьма иллюзий", 35),
    ("Заклинание замедления", 30),
    ("Призыв феникса", 100),
    ("Волна разрушения", 85),
    ("Сфера антимагии", 60),
    ("Ледяной шторм", 75),
    ("Огненная вспышка", 50),
    ("Штормовой удар", 80),
    ("Заклинание невидимости", 20),
    ("Заклинание молчания", 15)
]
```

### 5*. Нахождение повторяющихся элементов
До этой задачи всё равно опять никто не дойдёт, поэтому и оформлять я её не буду. 
Дан список чисел. Найти все числа, которые встречаются более одного раза, и вернуть их в виде кортежа.